const Controller = require('egg').Controller;
var Mock = require('mockjs');
class UserController extends Controller {
  async index() {
    const {
      ctx
    } = this;
    const params = ctx.query;
    var data = Mock.mock({
      'user1|1': [{
        'name|1': [
          "admin1"
        ],
        "username|1": ["我思故我在", "仗剑天涯"],
        "sex|1": ["男", "女"],
        "phone|1": ["18538666496",
          "15838966945"
        ],
        "sign|1": [
          "年龄永远不是衡量一个人的刻度，只有责任的叠加才会让人逐渐成长。",
          "往事不记后事不提，做个干净洒脱之人。"

        ],
        "status|1": ["离线", "在线"],
        "score|1": ["2021年5月28日",
          "2021年9月30日",
        ]
      }],
      "user2|1": [{
        'name|1': [
          "admin2",
        ],
        "username|1": ["草生二三寸", "释怀°"],
        "sex|1": ["男", "女"],
        "phone|1": ["15201000065", "15600288880", ],
        "sign|1": ["不顾别人感受是自私，太顾别人感受是自虐。",
          "山有峰顶，海有彼岸，漫漫长途，终有回味，余味苦涩，终有回甘。"

        ],
        "status|1": ["离线", "在线"],
        "score|1": ["2021年10月21日", "2020年1月25日", ]
      }],
      "user3|1": [{
        'name|1': [
          "admin3"
        ],
        "username|1": [
          "繁花落寂", "人海一粒渣",
        ],
        "sex|1": ["男", "女"],
        "phone|1": ["15275209977",
          "18861639111",
        ],
        "sign|1": ["无论做什么，不管想什么；初心是什么，结果得到什么；你都要善良，一如既往。",
          "人的感情就像牙齿，失去了就没了，再装也是假的。",
        ],
        "status|1": ["离线", "在线"],
        "score|1": ["2001年5月8日", "2021年5月28日", ]
      }],
      "user4|1": [{
        'name|1': [
          "admin4"
        ],
        "username|1": [
          "孤心", "眉眼藏山河",
        ],
        "sex|1": ["男", "女"],
        "phone|1": ["15388886388", "13902935986", ],
        "sign|1": ["人生充满了起起落落，关键在于，在顶端时要好好享受，在低谷时不失勇气。",
          "告诉自己：我可以不完美，但一定要真实；我可以不富有，但一定要快乐！",
        ],
        "status|1": ["离线", "在线"],
        "score|1": [
          "2021年9月30日", "2021年7月11日",
        ]
      }],
      "user4|1": [{
        'name|1': [
          "admin4"
        ],
        "username|1": [
          "配角", "我会慢慢长大"
        ],
        "sex|1": ["男", "女"],
        "phone|1": ["13612883913", "19826358222"],
        "sign|1": ["人生如行路，一路艰辛，一路风景，你的目光所及，就是你的人生境界。",
          "时间，带不走真正的朋友；岁月，留不住虚幻的拥有。",
        ],
        "status|1": ["离线", "在线"],
        "score|1": ["2001年1月21日", "2005年7月8日", ]
      }],
      "user5|1": [{
        'name|1': [
          "admin5"
        ],
        "username|1": [
          "失落叶", "风色幻想"
        ],
        "sex|1": ["男", "女"],
        "phone|1": ["17753585486", "13125848792"],
        "sign|1": ["朋友一生一起走",
          "那些日子不会有",
        ],
        "status|1": ["离线", "在线"],
        "score|1": ["2001年5月21日", "2009年7月8日", ]
      }],
    });
    let x = JSON.stringify(data, null, 4)
    this.ctx.body = x;
  }
}
module.exports = UserController;
